[
	{
		"ID": 550,
		"post_status": "publish",
		"post_excerpt": "History",
		"post_title": "The Communist Manifesto – why its axioms would not hold up in today’s era",
		"post_content": "Why would the Communist Manifesto not apply in today’s world?&nbsp;&nbsp;To answer this question, we must first examine the basis of Karl Marx’s profound thesis.&nbsp;&nbsp;Karl Heinrich Marx (May 5,1818 - March 14, 1883), was a German philosopher, economist, historian, and journalist. He is the author of the 1848 world famous political book, “The Communist Manifesto”, and the three-volume “Das Kapital.” Marx's political and philosophical thought had enormous influence on subsequent intellectual, economic, and political history. His name has been used as an adjective, a noun, and a school of social theory.&nbsp;The Communist Manifesto endeavors to elucidate the objectives of Communism, and the underlying hypothesis behind it.&nbsp;&nbsp;It propounds that class struggles arise due to the exploitation of one class by another. &nbsp;In his book, Marx argues that the modern industrial society in specific, is delineated by class conflict between the bourgeoisie and the proletariat. But capitalist sentiments represented in the form of productive forces rapidly cease to be competitive with this duplicitous relationship. &nbsp;As a corollary, the proletariat will revolt to create a new social order. However, this proletarian revolution will assume a different form than the revolutions from the past. &nbsp;Previous revolutions sought to reallocate property to the new ruling class that came about as a result of the revolution. &nbsp;However, by the nature of their class, the proletariat will be incapable of appropriating property. Therefore, when the proletariat become the ruling class, property ownership shall be destroyed which in turn will lead to the dissolution of class distinction.&nbsp;&nbsp;According to Marx, the Communists intend to promote this revolution by motivating the parties and associations that are moving history towards this inevitable denouement. The document contends that this evolution is inexorable. It proclaims that capitalism is unstable. The document further annunciates that elimination of social classes can only be achieved by means of a revolution, and that government reform will not suffice in effectuating this.&nbsp;&nbsp;The Communist Manifesto has four sections. In the first section, it discusses the Communists' theory of history and the relationship between the proletarians and bourgeoisie. The second section explains the relationship between the Communists and the proletarians. The third section addresses the flaws in other, previous socialist literature. The final section discusses the relationship between the Communists and other parties.&nbsp;In my opinion, there are are a few basic flaws in Marx’s philosophy as promulgated in the Communist Manifesto. I note them below:&nbsp;1. Based on Marx’s explanation, a finished product had no relationship to its price. He espoused the theory which was labeled the “Labor theory of &nbsp;Value (LTV), in which “total value” &nbsp;of a commodity is determined by the” socially necessary labor time.” To the extent that capital (machinery, raw material etc.) contribute towards this value, it is only the necessary labor time required to make that capital. Therefore, based on this logic, surplus is produced by workers (the proletariat), while capitalists are oppressors, and the sole reason they receive profit is because they pay their laborers less than what they produce. The finished product, therefore, according to Marx, had nothing to do with the price of the commodity, which in itself is the main contributor to profit. If the rate of profit falls due to the capitalists substituting capital for labor, then Marx’s theory holds good. However, if the rate of profit increases before a recession for example, then his theory would be falsified. Marx’s theory of attempting to equate profit to surplus arising from exploitation of the proletariat, is therefore tautological. It completely ignores the factor of the price of the commodity which is dictated by the forces of supply and demand.&nbsp;&nbsp;2. The class structure in today’s world is more complex than “Bourgeoise- Proletariat.” – In today’s world, most western nations and developing nations for that matter, there exists an extensive middle class that possess stocks, bonds, and investment property. This class comprises what Marx would have labeled “Capitalist class” in his time. However, in today’s society there is a class of entrepreneurs comprising industrialists and CEOs of big businesses that are a level higher than this class.&nbsp;3. Capitalism today is less exploitative. Most successful industrialists and businessman (the true “capitalist class”) realize that by paying their workers higher wages, they can generate more demand for their products, as workers tend to be more productive when they are paid higher wages. Additionally, these entrepreneurs promote “intrapreneurship” amongst the working class, that helps them to innovate and thereby help the company expand. Arthur Fry, who worked at Minnesota Mining and Manufacturing (3M), as product development researcher and is attributed to being the creator of the Post-It-Note is a good example of this intrapreneurship.&nbsp;&nbsp;4. Control of the Economic Base does not mean control of the overall Economic Environment – Marx argued that the class that controlled the economic base controlled the overall economic edifice. However, most of the institutions that exist today and those that wield substantial economic muscle, are relatively at arm’s length with “bourgeois” control.&nbsp;&nbsp;5. Many of today’s companies are “employee owned”- where the employees have a direct stake in the company’s policies, and where they own company stock. These employees, to a substantial degree, directly control their working conditions and lives.&nbsp;&nbsp;6. The fundamental concept of “Capitalism” has changed - Classic Marxist theory has been criticized for being economically deterministic. Marx argued that ‘economic laws’ determined not only the shape of society but also the direction of history itself. On reflection, however, it is evident that other factors have shaped history too – different societies have responded differently to the global spread of Capitalism – some have pushed neo-liberalism, (United Kingdom for e.g.), while yet others have taken a social democratic stance and have used the government as a “shield” to protect citizens from the worst effects of Capitalist exploitation (the Scandinavian countries); China has developed a form of autocratic- capitalism and other countries (Cuba and more recently Venezuela) have rejected it in favor of a Socialist dictatorship.&nbsp;In view of all of the above arguments, the Communist Manifesto, while a brilliant document, and Marx’s Magnum Opus, would not be relevant in today’s society."
	},
	{
		"ID": 541,
		"post_status": "publish",
		"post_excerpt": "",
		"post_title": "A new supreme court decision could help you save better for your retirement",
		"post_content": "<em>A legal battle had ensued in 2016 when current and former employees of Northwestern University sued the school and its retirement committee including the committee members who were responsible for the administration of the University’s 403 (b) plans that were covered by the Employment Retirement Income Security Act of 1974 (ERISA). </em>\n\n<em>The lawsuit filed by the employees alleged that the defendants failed to monitor and control the recordkeeping fees; offered retail class mutual funds and annuities that carried higher fees than identical class of shares with the same investments, and offered too many investment options, which led to confusion among participants. </em>\n\n<em>One of the fundamental clauses of ERISA states that the retirement savings of employees enrolled in the plan will be protected from mismanagement and abuse and clarifies that those in charge of those savings be held to a higher standard, i.e., they must act in the best interests of the plan participants. It also requires transparency and accountability, ensuring that participants have access to information about their plans. More than half of American workers earn health benefits on the job, and ERISA protects those too, in addition to other employee benefits. </em>\n\n<em>ERISA is administered and enforced by three bodies: the Labor Department’s Employee Benefits Security Administration, the Treasury Department’s Internal Revenue Service, and the Pension Benefit Guaranty Corporation.</em>\n\n<em>The lawsuit filed by the Northwestern employees in 2016 was initially dismissed in 2017 by the U.S. District Court, and the U.S. Court of Appeals for the 7<sup>th</sup> Circuit Court subsequently affirmed the lower court’s dismissal. However, in a six-page opinion published in late January 2022, the nation’s highest court vacated the prior U.S. Circuit Court ruling and remanded the case back to the appellate court for reconsideration. The Supreme Court was clear: plan sponsors failed to fulfil their fiduciary duty when they did not monitor the investment offerings and eliminated those deemed to be imprudent. &nbsp;Justice Sonia Sotomayor opined in her statement that a fiduciary’s failure to monitor investments and remove imprudent options constituted a breach in duty. Despite the fact that defined contribution plan participants chose their investments, plan fiduciaries must independently evaluate the plan’s menu of options to determine which are prudent.</em>\n\n<em>So, how will this decision affect the retirement industry going forward? It appears that, plan sponsors, going forward, will likely be more cautious and more judicious in terms of the investment options they offer, according to John Rekenthaler, Vice President of Research at Morningstar. </em><em>Simply offering a variety of investments and letting participants pick the best ones does not satisfy a plan sponsor’s fiduciary duty, according to the court.</em>\n\n<em>As of 2021, 403(b)s&nbsp;cover around one in five U.S. employees with around a&nbsp;</em><a href=\"about:blank\"><em>trillion of savings</em></a><em>&nbsp;in 403(b) plans.&nbsp;School districts typically offer 403(b) plans to their&nbsp;employees and there are approximately 8 million educators and&nbsp;</em><a href=\"about:blank\"><em>11 million non-profit employees</em></a><em>&nbsp;in the U.S. Both groups are likely to have 403(b) plans as retirement choices.</em>\n\n<em>403(b) plans are advantageous because money put away in these plans goes into the plan without any tax coming out first, and the return on the investment also grows tax free. While you do have to pay tax on the money when you withdraw the funds, you would typically withdraw after retirement. Most people tend to be in a lower tax bracket once they have retired, assuming no tax code changes between now and then. </em>\n\n<em>However, it is also important that the 403(b) plan that you decide to participate in, is covered by ERISA. While ERISA is not fool proof, it has some built-in safeguards that are in place to protect the savers. </em>\n\n<em>Tips to picking a good 403(b) plan: </em>\n<ol>\n \t<li><em>While there is admittedly no “one size fits all” way to invest, generally, picking lower cost funds that diversify across countries and or industries is definitely a good idea.</em></li>\n \t<li><em>It is also important to have a good mix of stocks and bonds as these two assets typically move in different directions over time, depending on the economic situation, thereby helping boost overall performance. </em></li>\n \t<li><em>Good asset classes to consider in the plan include diversified U.S. bonds, diversified U.S. stocks, and some Treasury Inflated Protection Securities (TIPS). These TIPS are typically referenced to the Consumer Price Index (CPI), and therefore their principal value is indexed to the rate of inflation. However, your choice of allocation of the funds you choose to invest will ultimately depend on your age, your risk appetite and when you plan to retire.</em></li>\n \t<li><em>One of the best aspects of a good 403(b) plan is the employer match.&nbsp; Some employers offer a matching contribution up to a certain percentage of the employee’s contribution, which makes the plan more lucrative. If you can afford it, you as an employee, should contribute up to the level of your employer’s match.</em></li>\n \t<li><em>If you're over 50, 403(b) plans enable you to contribute more to your retirement plan, just as a 401(k) would. However, also if you've been with your plan for 15 years, then you may be able to contribute even more to your plan. Potentially up to $21,000 in a single year, though the details depend on your employment status and plan. This can be helpful if you have an attractive 403(b) plan and are behind on retirement savings.</em></li>\n</ol>\n<em>&nbsp;</em>\n\n<em>Key differences between a 401 (k) plan and a 403 (b) plan:</em>\n<ul>\n \t<li><em>401(k) and 403(b) plans are qualified tax-advantaged retirement plans offered by <strong>employers to their employees</strong>.</em></li>\n \t<li><em>401(k) plans are offered by for-profit companies to eligible employees who contribute pre- or post-tax money through payroll deduction.</em></li>\n \t<li><em>403(b) plans are offered <strong>to employees of non-profit organizations and government.</strong></em></li>\n \t<li><em>403(b) plans are exempt from nondiscrimination testing, whereas 401(k) plans are not.</em></li>\n \t<li><em>You can also establish your own IRA account in addition to having an employer sponsored 403 (b) plan. See table below for contribution limits for the plan year 2022:</em></li>\n</ul>\n<style>/*! elementor - v3.5.5 - 03-02-2022 */<br />\n.elementor-widget-image{text-align:center}.elementor-widget-image a{display:inline-block}.elementor-widget-image a img[src$=\".svg\"]{width:48px}.elementor-widget-image img{vertical-align:middle;display:inline-block}</style>\t\t\t\t\t\t\t\t\t\t\t\t<img width=\"562\" height=\"514\" src=\"https://amorisfinancial.com/wp-content/uploads/2022/02/retirement-table.png\" alt=\"\" loading=\"lazy\" srcset=\"https://i0.wp.com/amorisfinancial.com/wp-content/uploads/2022/02/retirement-table.png?w=562&amp;ssl=1 562w, https://i0.wp.com/amorisfinancial.com/wp-content/uploads/2022/02/retirement-table.png?resize=300%2C274&amp;ssl=1 300w\" sizes=\"(max-width: 562px) 100vw, 562px\">"
	},

	{
		"ID": 521,
		"post_status": "publish",
		"post_excerpt": "Finance",
		"post_title": "Claiming Social Security at 70 – Analyzing your options",
		"post_content": "<p><b><i>“In this world, nothing is certain except death and taxes” – Benjamin Franklin </i></b></p><p><i>The above quote from one of the world’s leading scientist, inventor and founding father of the U.S. Constitution holds true now, and will, in the future.</i></p><p><i>Yet, you could safely add social security benefits to the fray of things that are certain. Social Security benefits are among the safest sources of retirement income which are backed by the U.S. Government and paid to you for as long as you live. </i></p><p><i>The minimum age to claim social security is 62, and while it is not mandatory to claim it at the age of 70, your retirement credits are “maxed out” at this age. Therefore, waiting to claim it after 70 will not provide any added benefit. The dilemma then is, should you wait until you are 70 to claim your social security benefits, or is it better to start claiming them as soon as you are 62 years of age? </i></p><p><i>The size of your social security benefit depends on a few factors, including how much you earned over the years, the year you were born, and the age when you start claiming – down to the month.</i></p><p><i>You’ll receive your full monthly benefit if you start claiming when you reach what Social Security considers your </i><a href=\"https://www.investopedia.com/terms/n/normal-retirement-age-nra.asp\"><i>full retirement age</i></a><i> (FRA), sometimes also referred to as “normal retirement age.” FRA was 65 when Social Security began, but it has been raised to 67 for anyone born in 1960 or later.</i><i> See FRA Chart below:</i></p><p> </p><p> </p>\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<img width=\"437\" height=\"512\" src=\"https://amorisfinancial.com/wp-content/uploads/2022/01/unnamed.png\" alt=\"\" loading=\"lazy\" srcset=\"https://i0.wp.com/amorisfinancial.com/wp-content/uploads/2022/01/unnamed.png?w=437&amp;ssl=1 437w, https://i0.wp.com/amorisfinancial.com/wp-content/uploads/2022/01/unnamed.png?resize=256%2C300&amp;ssl=1 256w\" sizes=\"(max-width: 437px) 100vw, 437px\" />\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t<p style=\"text-align: center;\">Finding your FRA: </p>\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<img width=\"240\" height=\"512\" src=\"https://amorisfinancial.com/wp-content/uploads/2022/01/unnamed-1.png\" alt=\"\" loading=\"lazy\" srcset=\"https://i0.wp.com/amorisfinancial.com/wp-content/uploads/2022/01/unnamed-1.png?w=240&amp;ssl=1 240w, https://i0.wp.com/amorisfinancial.com/wp-content/uploads/2022/01/unnamed-1.png?resize=141%2C300&amp;ssl=1 141w\" sizes=\"(max-width: 240px) 100vw, 240px\" />\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t<p><i>From the above table, if your FRA is 66 years, and assuming your full monthly benefit is $2,000, if your start claiming Social Security benefits at your FRA of 66 years, you will receive $2,000 per month.  However, if you start claiming benefits at age 62 (48 months earlier), then your benefits will be reduced to 75% of your full monthly benefit, and your check payment will be in the amount of $1,500.  Note that this reduced benefit will not increase when you turn 66. Rather, you will continue to receive the same amount of $1,500 for the rest of your life. The only adjustment you may notice would be the “Cost of Living Adjustment: (COLA) which may serve to increase your benefit amount marginally. For every year that you wait after becoming eligible to receive benefits, your monthly payment goes up by 8%, according to T. Rowe Price’s senior retirement insights manager, Roger Young. </i></p><p><i>However, from surveys conducted, it has been discerned that only approximately 6% of Americans wait until the age of 70 to claim their Social Security benefits. A whopping 94% claim their benefits as soon as they are eligible or shortly thereafter. </i></p><p><i>In making the determination whether to wait until 70 or withdraw earlier, some of the factors you should consider are: </i></p><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><i>Do you have the cash today that you need to meet your expenses?</i></li></ul><ul><li style=\"font-weight: 400;\" aria-level=\"1\"><i>Do you have an illness which may cause your lifespan to be shortened? </i></li></ul><p><i>If you do not have the level of savings to meet your current expenses, or you believe that a life-threatening illness may serve to reduce your lifespan, you would likely be better off claiming your benefits as soon as you are “FRA” eligible (or as early, at age 62). </i></p><p><i>If you claim earlier, you are essentially incurring the “opportunity cost” of money by trading a guaranteed lifetime payment (adjusted by COLA), for the volatile potential stock market profit, according to Brent Neiser, CEO, and host of “What’s Next with Money.”</i></p><p><i>The grim economic outlook for 2022 is portentous of lower expected market returns. Social security retirement benefits, </i><b><i>in alia manu, </i></b><i>will be there, despite the fact that Congress has yet to pass legislation to reinforce the Social Security Administration’s long term funding sources. </i></p><p><i>Even though you permanently reduce your benefit amount by withdrawing early, one option that some people consider is to take the reduced benefit and invest in the stock market. This is a good route for those who are financially savvy and can pick the right types of stocks, bonds, and mutual funds (that have yielded steady and higher returns than others in the same portfolio) over the past five, ten and fifteen years. </i></p><p><i>Some options to postpone early withdrawal and wait to maximize your benefits, may be available to people who have saved for their retirement. These people typically would start withdrawing funds from their 401K, withdrawing more initially until the maximum social security benefits kick in (at age 70), and then scaling back withdrawals from their 401K after they start to receive social security payments. However, this strategy is not “foolproof”, as the portfolio in your 401K is subject to market fluctuations, and if the value of the portfolio drops, it will lead to losses in your retirement age. To prevent this from occurring, it may be judicious for one to consider liquidating some of the portfolio of stocks and bonds just prior to retirement, and depositing the proceeds into a money market account, and then using funds from this money market account to meet your expenses for a period of time, until your retirement benefits kick in. </i></p><p><i>Yet another strategy to adopt is to send all the dividends that are earned on your stocks into your bank’s checking account. You can start adopting this strategy a few years before you reach your FRA. By the time you reach your FRA, if you have invested in good dividend yielding stocks, you may be able to build up a fairly decent amount in dividend income in your bank’s checking account. </i></p><p><i>Finally, you can elect to work a part-time job after retirement from your full-time job and earn supplemental income to meet your expenses until you reach the age of 70, which is when you would start drawing on your social security benefits. </i></p><p><i>To summarize, each person must size up their situation when they are at, or close to 62 years of age and decide whether to start drawing on your social security benefits or wait until you are 70 to maximize your benefit package.  It will be a judgmental call based on your financial situation and other circumstances, including </i><b><i>inter alia</i></b><i>, your health and your spouse’s health if applicable. One notion to ponder on is to educate yourself on types of investments available and learning at least the basics of stock market operations! </i></p><p><b><i>“Si scis uti pecunia, servus tuus est; nescis pecunia uti, ipse est dominus tuus.”</i></b></p>"
	},
	{
		"ID": 500,
		"post_status": "publish",
		"post_excerpt": "Space",
		"post_title": "James Webb Space Telescope, “The First Light Machine”",
		"post_content": "<p>Considered the most complex and expensive space observatory ever built, (at a cost of approximately $10 billion), the James Webb Space Telescope (JWST), finally launched on Saturday, December 25<sup> </sup>2021, on an Ariane 5 Rocket from Europe’s spaceport in French Guiana, South America.</p><p>The launch of the telescope had been plagued by multiple delays and a bevy of cost overruns. Its launch from the Korou spaceport off the coast of French Guiana at 7:20 am on December 25, 2021, brought fruition to NASA’s ambition to propel mankind into the future.</p><p>It is aptly labeled the “First Light Machine” as its flagship mission is to see the first stars and galaxies that emerged from dust and gas of the early universe. This dust and gas emanated perhaps only a few million years after the Big Bang.</p><p>By virtue of the extreme distances of these galaxies, the visible light they emitted when the universe was only a few hundred million years old, has shifted into the infrared part of the electromagnetic spectrum. This bizarre phenomenon is the result of the expansion of the universe and the subsequent “Doppler effect.” (the increase/decrease in the frequency of sound, light and/or waves as the source and observer move towards/away from each other). The JWST, admittedly the most incredible feat of engineering, is essentially a giant “heat” telescope that has a kapton shield coated with aluminum. In order to observe faint galaxies in infrared light, the telescope needs to be exceptionally cold or else it would only capture its own infrared radiation. The shield, which is five layers thick, and which measures 46.5 feet by 69.5 feet, will keep the mirror and the sensors at a temperature of minus 390 degrees Fahrenheit, to accomplish its mission of observing these faint galaxies. The five layers of the ultralight kapton material are precisely spaced so that the heat absorbed by each layer is perfectly radiated away from the spacecraft through the gaps. While superthin and ultralight, the material is also incredibly sturdy, enough to survive bombardment by meteorites.</p><p>The Webb telescope’s resolution is 100 times that of its aging predecessor, Hubble, and therefore is designed to peer back in time and explore the atmospheres of far-flung planets, spot some of the most distant observable galaxies, and could help elucidate some of the mystifying aspects of the universe, including its origin. At a cost of approximately $10 billion, the JWST is the single most expensive instrument ever developed for spaceflight!</p><p>The JWST will not orbit the earth. Unlike its predecessor Hubble, the Webb telescope will orbit the sun, approximately one million miles away from Earth at Lagrange point L2. <a href=\"#_edn1\" name=\"_ednref1\">[i]</a> A Lagrange point (eponymously named after the mathematician Joseph-Louis Lagrange), is the point where the gravitational pull of two large masses precisely equals the centripetal<a href=\"#_edn2\" name=\"_ednref2\">[ii]</a> force required for a small object to move with them. There are five Lagrange points. The L1, L2, and L3 points are all in line with each other, and L4 and L5 are at the points of equilateral triangles. What is special about this orbit is that it lets the telescope stay in line with the Earth as it moves around the Sun. This allows the satellite's large sunshield to protect the telescope from the light and heat of the Sun and Earth (and Moon).</p><p><a href=\"#_ednref1\" name=\"_edn1\">[i]</a> Source: NASA News</p><p><a href=\"#_ednref2\" name=\"_edn2\">[ii]</a> Centripetal force is a force that acts on a body moving in a circular path and is directed towards the center around which the body is moving.</p><p>The formula for calculating the centripetal force is Fc = mv<sup>2</sup>/r            </p><p>where Fc = Centripetal force, m = mass, v = velocity, r = radius</p>\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<img width=\"285\" height=\"157\" src=\"https://amorisfinancial.com/wp-content/uploads/2022/01/Picture1.jpg\" alt=\"\" loading=\"lazy\" />\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t<p> For the JWST to be able to observe the faint galaxies and determine the provenience of the universe, it will deploy its five-layer shield made of kapton material, in space.  The shield itself has an SPF of one million in terms of how much it attenuates the solar energy. It is critical to note that if the shield does not fully deploy, the telescope will not function, possibly rendering that function to be one of the most perturbing aspects of the spacecraft’s post-launch deployment sequence. After the successful deployment of the shield, the next gargantuan task will be to get the telescope’s secondary and primary mirrors into the proper configuration. The secondary mirror standing 2.4 foot wide is scheduled to be deployed first, followed by the primary mirror which is 21.3 feet wide and comprises 18 hexagonal segments arrayed across a central platform and two smaller side wings. </p><p>If all goes according to plan, the JWST will be in Lagrange point L2 approximately 29 days after launch and will be at its destination. But it doesn’t end here. Once the JWST has reached its destination, the NASA mission team will have to align the 18 primary mirror segments precisely so that they act as a single light collecting surface, and they will still need to calibrate the telescope’s instruments before it can start performing its scientific research.</p><p>If the Webb telescope survives launch, and all of its instruments successfully deploy as projected, the telescope could help us witness the birth of some of the universe’s youngest galaxies, born just 50 million years after the Big Bang, during a period classified as the Epoch of Reionization, which is the era where the universe was flooded with light pursuant to the emergence of the first stars and galaxies which sought to reionize (or make transparent), the hitherto opaque  universe!</p><p>The development of such an instrument by human minds causes us to exclaim, “<strong><em>Mens humana potentissima est Dei creatio.”</em></strong></p>"
	},
	
	{
		"ID": 467,
		"post_status": "publish",
		"post_excerpt": "Finance",
		"post_title": "“To trust or not to trust.” - A case for establishing a revocable living trust.",
		"post_content": "As we slowly descend into the senescent stage of our lives, two prime considerations that we must be cognizant of are (1) having necessary retirement savings to fund our future in a manner that will enable us to cherish the remaining golden years and (2) a strategy to account for our real estate.Contrary to popular belief, estate planning is not merely for the rich. The question isn’t whether you need estate planning, but rather what type of estate planning you need.Much as it may sound like an oxymoron, one strategy that will allow you to exert some control over your money even after you pass away, is to establish a revocable living trust.&nbsp;A revocable living trust is established by a written agreement or declaration that appoints a trustee to manage and administer the property of the grantor. As the grantor or creator of the trust, you can name any competent adult to be your trustee; some people even prefer to choose a bank or a trust company to fulfil this role.Once the trust has been established, you would start putting all your assets including investments, bank accounts and real estate into the trust. Having done so, you would no longer own the asset. All the assets would now belong to the trust. However, since you establish it as a revocable living trust, you retain control of the assets while you are alive, even though they don’t belong to you. You may choose to amend or change the trust at any time. While income generated by the trust is taxable, the assets themselves would not transfer to the designated beneficiaries of the trust until after your death. The key advantages of establishing a revocable living trust for your assets are:a. &nbsp; &nbsp; &nbsp;Avoidance of Probate – your beneficiaries would avoid the hassle of presenting documents to a probate court and going through multiple steps to claim their inheritance.b. &nbsp; &nbsp; &nbsp; Governable and flexible – The revocable living trust permits you to make changes to the trust documents while you are alive at your discretion.c. &nbsp; &nbsp; &nbsp;Eliminate challenges to the Estate – avoids disputes that would normally be created by a standard will.d. &nbsp; &nbsp; &nbsp;Segregation of Assets - The trust can help segregate assets from the community property assets.e. &nbsp; &nbsp; &nbsp;Assignment of Durable Power of Attorney /Guardianship – A living trust can be used to control a guardian’s spending habits for the benefit of your minor children. Additionally, it can also authorize another person to act on your behalf should you become incapacitated and need someone to make a decision for you.Go ahead, set up a revocable living trust, and “Vivere in pace."
	},
	{
		"ID": 449,
		"post_status": "publish",
		"post_excerpt": "Finance",
		"post_title": "Build Back Better Plan - What it entails and the impact of its blockage on the economy",
		"post_content": "A $1.75 trillion spending bill was making its way through Congress , where it passed in November 2021. However, a key Democratic Senator blocked the bill in the Senate claiming that it was objectionable as the bill contained a cornucopia of progressive entitlements, inflationary pressures and&nbsp;&nbsp;universal handouts.&nbsp;\n\nAs a result of the blockage by the Senator,&nbsp;&nbsp;some economists lowered expectations for U.S. economic growth next year, causing an already gloomy&nbsp;&nbsp;economic landscape spawned by the spread of the CoVID Omicron variant, to look even more tenebrous.&nbsp;&nbsp;\n\nGoldman Sachs announced that it had lowered its growth forecast from 3 percent to 2 percent in the first quarter of 2022; 3.5 percent to 3 percent in the second and from 3 percent to 2.75 percent in the third, Bloomberg reported.\n\nOne key element that could slow economic&nbsp;growth is the reduction of the enhanced tax credit that enabled families to collect up to $300 per child but that is set to expire on December 31, 2021.&nbsp;\n\nWhile the Federal&nbsp;&nbsp;Reserve announced in early December that it would double the pace of its bond buying wind down as a result of high employment growth&nbsp;&nbsp;and the surge in inflation,&nbsp;&nbsp;it could prove difficult for the U.S. Central bank&nbsp;&nbsp;to roll out its three proposed interest rate hikes if the economy grew at a slower pace than initially expected.&nbsp;\n\nWhat does the Build Back Better Plan contain, and what would be its impact on the US economy if it passed? Here are the key elements of President&nbsp;&nbsp;Biden’s “BBB” plan:\n\nI. The plan would implement two tax relief programs immediately; i)&nbsp;The expanded child tax credit and ii)&nbsp;The earned income tax credit. These tax reliefs translate to higher government spending compared to the revenues it takes in. By virtue of increased government spending,&nbsp;consumer demand will increase, spurring a modest increase in inflation.&nbsp;&nbsp;With inflation already being at near record highs,&nbsp;many economists are unanimous in their belief that higher inflationary pressures would increase the economic cost of bringing inflation back under control.&nbsp;\n\nII.&nbsp;&nbsp;Universal Pre -K&nbsp;&nbsp;- The plan establishes universal and free Pre school for more than 6 million 3-4 year olds. Parents will be able to send their children to high quality pre-school in the setting&nbsp;of their choice -&nbsp;from public school to child care providers to Head&nbsp;Start.&nbsp;\n\nIII. Climate Investments - The plan sets aside $550 billion for clean energy and other climate change initiatives, including an enhancement of existing home energy and efficiency tax credits, an electrification focused rebate program and a&nbsp;&nbsp;credit of up to $12,500&nbsp;&nbsp;for union-made (U.S.) electrical vehicles.&nbsp;\n\nIV. Extended Medicaid coverage&nbsp;&nbsp;and reduced premiums for Affordable Care Act coverage&nbsp;&nbsp;for which the plan sets aside $130 billion.&nbsp;&nbsp;It is estimated to drop premiums for an estimated 9 million people by an average of $600 per year.&nbsp;\n\nV.&nbsp;&nbsp;The plan sets aside $150 billion for Affordable Housing to include down payment assistance for first generation home buyers, investment in rental assistance and housing vouchers and&nbsp;&nbsp;construction and rehabilitation of more than 1 million affordable homes across the United States.&nbsp;\n\nAll of the above measures involve a significant amount of Federal spending.&nbsp;&nbsp;To discern why perhaps this bill may not serve the best interest of the US economy, economists point to the following flagrancies:\n\n&nbsp;a. This is the fourth multi trillion dollar spending bill that the House has passed in the past 12 months. First to pass was the $1 trillion CoVID relief bill passed in the waning days of the Trump presidency. Next&nbsp;in March this year, Congress passed a $1.9 trillion bill for certain states that shut down their economies the year before the pandemic. Then, in November of 2021, the House passed another $1.2 trillion&nbsp;bill that included subsidies for green energy programs. Critics call attention to the fact that spending $6-$7 trillion combined (from all the bills including this proposed “BBB” bill)), is not judicious when the economy is already in a recovery. To these critics, this type of spending in times of recovery is a harbinger of runaway inflation.&nbsp;\n\nb. While proponents of the bill argue that the bill seeks to mitigate income inequalities, they do not acknowledge the loophole introduced in the bill that allows the wealthy to deduct state and local taxes from their federal tax bills, effectively allowing them to pay less federal income tax.\n\nBeing almost year end, it is highly unlikely that the bill will&nbsp;&nbsp;pass in the Senate. It may likely be resurrected early next year, albeit with amended clauses.&nbsp;&nbsp;If passed, the bill’s&nbsp;impact on the US economy will likely play out as a dénouement from a high adrenaline filled Hollywood action movie. To lend clarity to the statement, the unraveling of the effects of the bill’s passage on the economy will likely be tumultuous for a majority of consumers. The confluence of high inflation and rising demand for goods and services by virtue of increased government spending, may not be efficacious&nbsp;apropos to economic growth . At this juncture, we can only say&nbsp;&nbsp;“Spem Optimam!”"
	},
	{
		"ID": 390,
		"post_status": "publish",
		"post_excerpt": "Finance",
		"post_title": "The Debt Ceiling Controversy",
		"post_content": "<h3><em>“Biden signs debt-ceiling increase, preventing first-ever US default” – CNBC News, December 16, 2021 </em></h3><p>Just as the nation verged on the brink of economic collapse, President Joe Biden signed a debt ceiling increase into law on Thursday, December 16<sup>th</sup>. The law raised the debt ceiling by $2.5 trillion, which, it was estimated, would enable the Federal Government to cover its financial obligations into Fiscal Year 2023.  Treasury Secretary Janet Yellen had prognosticated the disastrous consequences of not raising the debt ceiling in the form of recession and job losses across the nation.</p><p>What is the debt ceiling then, and why should it matter to the populace?</p><p>The U.S. debt ceiling is the total amount of money the U.S. Government is authorized to borrow to meet its existing obligations such as Social Security payments, tax refunds, interest on the national debt and our national defense.  This ceiling is imposed by Congress and represents the amount of debt that the U.S. Federal government can have outstanding. In decades past, raising the debt ceiling was a routine legislative exercise. However, in recent times, the issue has been politicized and the parleys over it have sparked continued market turbulence. The debt ceiling is different from budget deficits. Budget deficits are caused because the U.S. government spends more money than it brings in through tax and other revenues. Therefore, it must borrow large sums of money to pay the bills caused by the deficit.</p><p>It is interesting to note that the debt limit had been temporarily suspended in 2019, but the suspension period expired on July 31, 2021.  The concept of the debt ceiling dates back to 1917, when Congress first enacted the legislation to gain the support of reluctant members for entering World War I.  The theory postulated in reference to the debt ceiling was that involvement in the war would be more copacetic if there was a limit to the financial commitment.</p><p>So, what happens when the U.S. government reaches its debt limit?</p><p>Once the debt limit is hit, the Federal Government cannot increase the amount of outstanding debt; but must only draw from its cash on hand and spend its incoming revenues.  Hence the need to raise the debt ceiling. It should be expressly elucidated at this juncture that raising the debt limit does not authorize any <strong><em>new spending</em></strong>, but simply allows the Federal Government to finance existing obligations.  It is akin to an increase in a consumer’s credit card borrowing limit.</p><p>The notion of placing a nominal dollar debt limit on a federal government is not a common practice in today’s global economy. <strong><em> </em></strong>Interestingly, Denmark is the only other developed nation that has adopted this concept. <strong><em>Quand meme</em></strong>, deficits are something that every nation worries about, and seeks to manage, some better than the others.</p><p>Many economists around the world are of the view that in the current era of low interest rates, budget deficits should not be a gargantuan concern. Their rationale is that inasmuch as the economy is growing at a rate faster than the level of real interest rates, the economic growth will diminish the ratio of debt to GDP over time. To put it in perspective, the U.S. national debt as of July 2021 was approximately $29 trillion<a href=\"#_ftn1\" name=\"_ftnref1\">[1]</a>, while the US GDP as of the third quarter 2021 was $23.19 trillion.<a href=\"#_ftn2\" name=\"_ftnref2\">[2]</a></p><p>Is there an alternative?</p><p>The question is, if the debt ceiling were to be done away with, what would replace it?  Former presidents have opined about how the issue could be dealt with. President Barack Obama at one point had proposed that Treasury could issue a $1 trillion coin to pay off some of the national debt. President Bill Clinton had stated during the 2011 debt ceiling battle that if he were the incumbent, he would invoke the 14<sup>th</sup> Amendment which states that the validity of United States debt shall not be questioned and proceed to raise the debt ceiling.  As proposed solutions to the issue, one line of thought is for the U.S. to follow the Denmark model and raise the debt ceiling egregiously high. Another set of economic gurus have opined that the debt ceiling or limit should increase in regimen with new funding.  In the absence of a formal decision to the contrary, it appears that the debt ceiling is here to stay, <strong><em>pro tempore!</em></strong></p><p><a href=\"#_ftnref1\" name=\"_ftn1\">[1]</a> Cnet/Money, December 16, 2021</p><p><a href=\"#_ftnref2\" name=\"_ftn2\">[2]</a> Bureau of Economic Analysis, May 2021</p>"
	},
	{
		"ID": 371,
		"post_status": "publish",
		"post_excerpt": "Finance",
		"post_title": "1031 Exchanges – Are they truly beneficial?",
		"post_content": "As an investment property owner, it is advantageous to review your portfolio of properties to identify new opportunities as the market situation changes. Often it may be propitious for owners to sell their existing properties in exchange for another real estate opportunity. In executing these types of transactions, it would be worthwhile to consider performing a “1031 Deferred Exchange.”\n\nEssentially, a “1031 Exchange”, also known as a “Starker Exchange”, is a property exchange rule that allows real estate investors to buy and sell investment properties while deferring payment on all or some capital gains incurred at the time of exchange. The term 1031 exchange is derived from Section 1031 of the Internal Revenue Code (IRC) which allows for this procedure.\n\nIn a nutshell, a 1031 exchange can be considered a “rollover”, as sales proceeds from a property sold is rolled over into a purchased property to “postpone” the capital gains tax that resulted from the sale.&nbsp; The purchased property can be considered as the “exchange” property and would meet the exchange requirements if it is: (1) a like-kind real estate investment titled in the same manner as the property that was sold (2) identified within 45 days and purchased within 180 days of closing of the sold property&nbsp; (3) equal to or greater than the value of the sold property and (4) purchased through a third party “exchange facilitator.”\n\nTo meet the above criteria, investors must therefore retain the services of a qualified intermediary who will hold the proceeds from the sale of the original property and then will transfer the funds to the seller of the replacement property at the time of closing on the transaction. The qualified intermediary so identified must be a person or company who has no stake in the exchange and the funds involved. Additionally, the investor must identify the exchange property within 45 days of sale of the original property. Once this window closes, the 1031 exchange is considered failed and funds from the sale of the original property are considered taxable. It must also be borne in mind that once the property has been identified within 45 days of the sale of the original property, the investor must settle on the exchange property within 180 calendar days from the date of the original property sale. This window can even be shorter if the due date for the income tax return for the tax year in which the previous property was sold falls within the 180-day window. In this case, the settlement of the exchange property is due by the tax return date, failing which the 1031 exchange shall fail and the funds from the sale of the original property will be deemed taxable.\n\nAnother important point to note is that the individual selling the relinquished property must be the same as the one purchasing the new property. The names on both properties must match between tax returns and property titles for the exchange to qualify under the 1031 rule. The only exception to this rule is in the case of single member LLCs.\n\nOnce the 1031 process is complete, the investor does not have to pay capital gains tax that they would normally have had to pay on the sale of their property under normal circumstances. If the investor has purchased replacement or exchange properties at or above the value of the relinquished property, then they do not need to pay capital gains taxes at all. These taxes can be deferred indefinitely if you never perform another property sale!\n\nSo, what are the pros and cons of performing a 1031 exchange, and is it truly beneficial? Here are the key points to note:\n\n<strong><em><u>Pros</u></em></strong>\n<ol>\n \t<li>Perhaps the most significant advantage of a 1031 exchange is that it allows investors to defer the capital gains tax, so they can use the entire proceeds from a sale to purchase properties of greater value rather than paying a portion of those proceeds towards taxes. By minimizing the loss of purchasing power, investors can grow their wealth faster and thus open more opportunities for investment.</li>\n \t<li>Another lucrative feature of the 1031 exchange is that the deferred taxes owed to the IRS after performing the exchange, are erased upon the investor’s death! Insomuch as the investor continuously performs 1031 exchanges to purchase properties of equal or greater value through their lifetime, they can grow their wealth tax free and pass it on to their heirs who will inherit the property without the deferred taxes.</li>\n</ol>\n<strong><em><u>Cons</u></em></strong>\n<ol>\n \t<li>The rules for qualifying a transaction as a 1031 exchange are stringent, and must be followed to the letter, else they will be considered a failure. It is crucial to be cognizant of what properties will qualify as a 1031 exchange in advance, as well as the relevant purchasing guidelines associated with the exchange.</li>\n \t<li>The time pressure requirements for qualifying a real estate transaction as a 1031 exchange, often lead investors into impulsively making bad investments just to avoid paying taxes. Purchasing a bad parcel of property either because of its location or market could potentially cost more than the capital gains tax in the first place.</li>\n \t<li>The “neutral” third party intermediaries who hold the funds from the initial sale of the property and provide them at the time of purchase of the exchange property, charge a fee for their services. The fees could range from $600 at the lower end to $1,500, plus incidental charges including overnight delivery of documents etc. These charges may take a bite out of the savings from deferred capital gains.</li>\n</ol>\nWhile the above pros and cons are not “all inclusive”, it would be judicious for any investor contemplating performing a 1031 exchange to consult with a tax accountant and/or a real estate professional prior to engaging in it. &nbsp;A sagacious piece of advice to those contemplating executing such an exchange: <strong>“c<em>aute procedere.”</em></strong>"
	},
	{
		"ID": 362,
		"post_status": "publish",
		"post_excerpt": "Space",
		"post_title": "The Universe – A cornucopia of infinite wonders",
		"post_content": "“Cosmos is a Greek word for the order of the universe. It is, in a way, the opposite of Chaos. It implies the deep interconnectedness of all things. It conveys awe for the intricate and subtle way in which the universe is put together.” – Carl Sagan\n\nSo exactly, how is the universe put together? Furthermore, how are the distances between stars calculated, and how precise are those measurements?\n\nFrom early childhood, the universe and all its contents always fascinated me. I envisioned becoming an astronaut. Given my height, I may have even fit the resume, as astronauts traveling in a space capsule can be no more than 5 feet 11 inches tall (Source: NASA Facts).\n\nTo bring me closer to my dream, I worked at NASA for a very long time. Unfortunately, I worked in the capacity of a Financial Management Consultant and not a scientist with an inclination to travel in a space capsule. To satisfy my inner yearning though, I made it a point to listen to the NASA astronauts speak in the NASA auditorium, every time they came back from a space mission, until the year 2013.\n\nThe observable universe as we know it today, has a measurable diameter of approximately 93 billion light years! A light year incidentally is a unit of astronomical distance equivalent to the distance that light travels in one year, which translates to 9.4607 *10<sup>12 &nbsp;&nbsp;</sup>or nearly 6 trillion miles. (Light travels at the speed of 186,411 miles per second). The universe is also 13.77 billion years old (as measured by the time elapsed since the “Big Bang”).<a href=\"#_ftn1\" name=\"_ftnref1\">[1]</a>\n\nThese flummoxing pieces of data that we assimilate from astronomers and astrophysicists, then begs the question; exactly how accurate are these measurements and what is the margin of error in their calculation?\n\nTo assuage the aporetic minds, it is interesting to note that in January 2014, scientists comprising the Baryon Oscillation Spectroscopic Survey (BOSS), using the Sloan Foundation Telescope in New Mexico, successfully measured the distance between galaxies in the universe to an accuracy of just 1%. <a href=\"#_ftn2\" name=\"_ftnref2\">[2]</a>\n\nThis stupendous precision across six billion light years was accomplished using the Baryon Acoustic Oscillation (BAO)s as a “standard ruler” to measure intergalactic distances.&nbsp; BAOs are the frozen imprints of pressure waves that moved through the early universe and helped to set the distribution of galaxies we see today. The “ruler” is approximately half a billion light years long, so it can be used to measure distances precisely even from very far away, according to Daniel Eisenstein, Director of the Sloan Digital Sky Survey III.\n\nAstronomers have also been successful in developing several techniques to indirectly measure the vast distances between Earth and the stars and galaxies. One of those techniques is the parallax method. Parallax is the visual effect produced when, as an observer moves, nearby objects appear to shift position relative to more distant objects. As the Earth orbits the Sun, the astrophysicists invoke the same principle to determine the distance to nearby stars. By carefully measuring the angle through which the star has moved over the course of the year and knowing how far the Earth has moved, they are able to calculate distances between the Earth and stars. Astronomers use one Astronomical Unit or AU (which is the distance from the Earth to the Sun or approximately 93 million miles) as the base measure. Additionally, they use small angles called arcseconds which are tiny fractions of a degree of the night sky. Dividing the baseline of one AU by the tangent of one arcsecond produces a result of 19.2 trillion miles or 3.26 light years. This unit of distance is called a parallax second or parsec which is then used to calculate the distance to the star from Earth.\n\nIf the above obfuscating and confounding information was not sufficient to whet your appetite for space facts, here are some more astonishing facts about our universe and space to leave you nonplussed:\n<ol>\n \t<li>The universe is believed to contain more than a septillion stars. That is more than 1,000,000,000,000,000,000,000,000!</li>\n \t<li>95% of the Universe is invisible! Only 4.9% of the mass energy of the universe is made up of atoms – the kind of stuff we, the stars and galaxies are made of. Approximately 26.8% of the cosmic mass energy is invisible dark matter which is revealed only because it tugs with its gravity on the visible matter. 68.3% of the universe is dark energy, which is invisible, yet it is accelerating cosmic expansion.</li>\n \t<li>The Sun makes up 99.8% of the total mass in our Solar system, leaving 0.2% for the planets and everything else.</li>\n \t<li>It takes 8 minutes and 20 seconds for sunlight to reach Earth.</li>\n \t<li>The moon is drifting away from the Earth at the rate of 1.5 inches every year. In a few billion years, the moon will eventually move out of the Earth’s field of gravity.</li>\n \t<li>The closest galaxy to our Milky Way is the Andromeda Galaxy. Currently, it is 2.5 million light years away from our Milky Way. However, it is hurtling towards the Milky Way at a speed of 110 kilometers per second and is estimated to collide with it in approximately 4.5 billion years.</li>\n \t<li>Olympus Mons is the tallest mountain in our solar system. It is located on Mars and is the planet’s largest volcano. The mountain’s peak is 16 miles high, making it roughly three times taller than Mount Everest.</li>\n \t<li>Unlike other planets, Venus rotates clockwise on its axis. Additionally, a day on Venus lasts longer than a year. Due to its slow and retrograde rotation, a day on Venus lasts 243 Earth days, while it revolves around the Sun in 224.7 Earth days, making a day on Venus longer than a year.</li>\n \t<li>The Astronauts footprints on the moon will last for millions of years, since there is no atmosphere on the moon, therefore no river or wind to wash them away.</li>\n \t<li>To match the energy the Sun produces, you would need to light up 100 billion tons of dynamite every second!</li>\n</ol>\nAs they say in Latin, “<em>mirabilia numquam desinunt” – Miracles never cease!</em>\n\n<a href=\"#_ftnref1\" name=\"_ftn1\">[1]</a> Planck Collaboration 2020 – “Astronomy and Astrophysics”\n\n<a href=\"#_ftnref2\" name=\"_ftn2\">[2]</a> BBC News – January 2014"
	},
	{
		"ID": 322,
		"post_status": "publish",
		"post_excerpt": "Finance",
		"post_title": "Crypto Tax Reporting Requirements – What you should know",
		"post_content": "<p>A bipartisan group of House representatives recently introduced a bill to address a disputatious new tax reporting requirement for reporting cryptocurrency.</p><p>The bill known as “The Keep Innovation in America Act”, seeks to serve as a palliative measure to fix section 80603 of the Infrastructure Investment and Jobs Act that deals with digital asset reporting requirements.</p><p>Currently, section 80603 of the Infrastructure Investment and Jobs Act has introduced the following legislation: (a) Expanded the definition of a broker to include more digital asset entities for tax reporting that were not meant to be included. As an example, miners and validators, hardware and software developers are not “true brokers” and are not required to collect or report digital asset information. (b) Expanded the definition of cash for reporting purposes to include any “digital asset” requiring large transactions to be reported, raising privacy concerns. (c) Delegated broad authority to the Department of Treasury to modify the definition of a digital asset which could have long lasting and potentially pernicious implications.</p><p>From a pragmatic perspective, Section 80603 of the Infrastructure Investment and Jobs Act does not work in the current digital asset ecological community. Reporting on digital asset transactions should be consistent and the requirements to report must be unambiguous.</p><p>The Keep Innovation in America Act seeks to ameliorate these ambivalent regulations by:</p><ol><li>Redefining the term “broker” to include only those individuals or entities who are in the business of brokering and are required to report digital currency transactions.</li><li>Elucidate the requirements that must be captured by these brokers when transferring these digital assets to an account maintained by a non-broker.</li><li>Explore the consequences of expanding the definition of cash for reporting purposes.</li></ol><p>The Keep Innovation in America Act is the bipartisan solution to corroborate that digital asset reporting requirements under current law match the technology’s <em>modus operandi</em>. Congress must pursue its endeavor to bring legal and regulatory certainty to ensure these technologies and entrepreneurs continue to flourish here in the U.S, rather than taking their wealth abroad. In these precarious economic times, the lattermost thing we can afford is capital flight, which would be “<em>mauvais pour l’economie.” </em></p>"
	},
	{
		"ID": 302,
		"post_status": "publish",
		"post_excerpt": "Finance",
		"post_title": "Is the Federal Reserve’s recent hawkish tilt a reflection of economic reality?",
		"post_content": "The U.S. Federal Reserve recently announced a plan to attenuate its $120 billion a month in bond purchases, as a gambit towards winding down a post-coronavirus money printing program that stimulated many investors to buy bitcoin as a hedge against inflation. Purchases of U.S. Treasuries are projected to drop by $70 billion a month from the current $80 billion, while the purchase of mortgage-backed securities will decline to $35 billion from $40 billion. &nbsp;Under the Fed’s newly announced plan, the Fed will continue to wind down its asset purchase by $15 billion a month until the program concludes sometime during the middle of next year. &nbsp;This asset purchase program was a form of stimulus funded by newly created money, known as “quantitative easing” or “QE.” This QE policy has helped to double the Fed’s balance sheet to approximately $8.6 trillion as of November 2021.\n\nThe U.S. central banks have left interest rates unchanged but a growing number of financial analysts in traditional markets are predicting that the Fed might have to start hiking the benchmark rate to tame inflation at a time when U.S. consumer prices are rising at a full gallop and a pace not seen in decades.\n\nThe Fed’s hawkish tilt reflects the reality of the U.S. economy. &nbsp;The delta variant has slowed the economic expansion, not ended it. The Fed’s <strong><em>real</em></strong> GDP projections for this year were noticeably lower than June’s forecast but also were significantly higher for 2022—3.8% vs. June’s 3.3% projection. Historically, such growth has not required substantial monetary accommodation, albeit it would be fair to say that the Covid crisis has presented unique challenges. Inflation forecasts have subsequently been raised as supply-chain bottlenecks and related Covid shortages have proved beleaguering. This tribulation certainly has made the case for a potentially earlier start to tightening of the fiscal policy, though the September projections still suggest inflationary pressures ultimately will prove transitory, with core&nbsp;Personal Consumption Expenditure index (PCE), falling from 3.7% this year (up from June’s projected to 3.0%) to 2.3% in 2022 and 2.1% in 2023.\n\nWhile it is optimistic to believe that inflationary pressures that we are experiencing may be transitory, circumstances could cause it to be a runaway inflation too. In the debate about whether inflation is transitory or runaway, the truth likely lies somewhere in the middle: Inflation is likely to be&nbsp;<a href=\"https://www.oxfordeconomics.com/my-oxford/publications/635121\">sticky, but not </a>inexorable. However, with successive shocks destabilizing global supply chains and labor supply still tight, many pundits worry about a 70s-style burst of stagflation, fearing that we’re headed for an economy with rampant inflation and feeble activity.&nbsp; The Federal Open Market Committee or “FOMC” however seeks to alleviate the impact of this disquieting prophecy by stating earlier this month, that though inflation was elevated, the factors behind the consumer price increases were expected to be transitory. Whoever we choose to believe in, it would most likely be a case of believing in <em>“Amicus Certus in re incerta.”</em>"
	}
	
	
]